{
  "scopeName": "indeed",
  "name": "indeed-mcp",
  "friendlyName": "Indeed",
  "connection": {
    "type": "HTTP",
    "url": "https://mcp.indeed.com/claude/mcp"
  },
  "description": "Search and interact with job listings through natural language. Access millions of jobs, post listings, and manage recruitment on the world's largest job site.",
  "icon": "https://www.indeed.com/favicon.ico",
  "unlisted": false,
  "metadata": {
    "categories": "Job Board",
    "official": true,
    "mesh_unlisted": true,
    "tags": ["jobs", "recruitment", "hiring", "job-search", "indeed", "hr", "talent-acquisition", "careers", "employment"],
    "short_description": "Search and interact with job listings on the world's largest job site",
    "mesh_description": "Indeed is the world's #1 job site with over 350 million unique visitors per month and millions of job listings across all industries and experience levels. This official MCP enables job seekers to search and filter through comprehensive job listings using natural language queries, save favorite jobs, set up job alerts for specific criteria, and research companies with reviews and ratings from current and former employees. For employers and recruiters, the MCP provides tools to post job listings with detailed descriptions, requirements, and company information. Manage applications with applicant tracking features, review candidate profiles and resumes, schedule interviews, and communicate with applicants directly through the platform. Access powerful analytics on job posting performance including views, clicks, and application rates. Use Indeed's matching technology to find qualified candidates based on skills, experience, and location. Leverage salary insights and market data to create competitive compensation packages. Set up sponsored job postings to increase visibility and reach more qualified candidates. Configure screening questions to pre-filter applicants and save time in the hiring process. Perfect for both job seekers looking for their next opportunity and companies building their teams with top talent."
  }
}
