{
  "scopeName": "github",
  "name": "github-mcp-server",
  "friendlyName": "GitHub",
  "connection": {
    "type": "HTTP",
    "url": "https://api.githubcopilot.com/mcp/"
  },
  "description": "Interact with GitHub platform through natural language. Manage repositories, issues, pull requests, analyze code, and automate workflows with AI assistance.",
  "icon": "https://github.githubassets.com/assets/GitHub-Mark-ea2971cee799.png",
  "unlisted": false,
  "metadata": {
    "categories": ["Developer Tools"],
    "official": true,
    "tags": ["version-control", "git", "github", "repositories", "code-review", "ci-cd", "collaboration", "open-source", "devops"],
    "short_description": "Interact with GitHub platform through natural language",
    "mesh_description": "GitHub is the world's leading software development platform with over 100 million developers collaborating on open source and private projects. This official MCP Server enables natural language interaction with GitHub's comprehensive features including repository management, code hosting, and version control. Create and manage repositories with README files, .gitignore templates, and licenses. Handle issues and bugs with labels, milestones, assignees, and project boards for agile workflows. Review and merge pull requests with inline comments, suggested changes, code reviews, and automated checks. Manage branches, tags, and releases with semantic versioning and release notes. Configure GitHub Actions for CI/CD pipelines with automated testing, building, and deployment workflows. Set up branch protection rules, required reviews, and status checks for code quality. Use GitHub Projects for kanban boards and roadmap planning. Manage team access with organizations, teams, and granular repository permissions. Access code search to find specific functions, patterns, or files across repositories. Use GitHub Packages for hosting and managing Docker containers and software packages. Configure webhooks and integrations with third-party services. Access GitHub API for advanced automation and custom integrations. Perfect for development teams managing codebases, coordinating releases, and maintaining high code quality through collaborative workflows."
}
}
