{
  "scopeName": "google",
  "name": "google-gke-mcp",
  "friendlyName": "Google GKE",
  "connection": {
    "type": "HTTP",
    "url": "https://container.googleapis.com/mcp"
  },
  "description": "Manage Kubernetes clusters on Google Cloud with GKE. Deploy, scale, and monitor containerized applications through natural language commands.",
  "icon": "https://www.gstatic.com/images/branding/product/2x/gke_64dp.png",
  "unlisted": false,
  "metadata": {
    "categories": "Developer Tools",
    "official": true,
    "mesh_unlisted": true,
    "tags": ["kubernetes", "containers", "docker", "orchestration", "google-cloud", "gke", "devops", "microservices", "cloud-native"],
    "short_description": "Manage Kubernetes clusters on Google Cloud with GKE",
    "mesh_description": "Google Kubernetes Engine (GKE) is a managed Kubernetes service that simplifies deploying, managing, and scaling containerized applications using Google's infrastructure. This official MCP enables you to create and manage GKE clusters with autopilot or standard modes, configure node pools with custom machine types, and implement cluster autoscaling based on workload demands. Deploy applications using Kubernetes manifests, Helm charts, or Kustomize configurations. Manage pods, deployments, services, ingress, config maps, and secrets through intuitive natural language commands. Configure networking with VPC-native clusters, private clusters, and workload identity for secure service authentication. Set up horizontal pod autoscaling, vertical pod autoscaling, and cluster autoscaler for optimal resource utilization. Implement CI/CD pipelines with GKE integration, rolling updates with zero downtime, and canary deployments for gradual rollouts. Monitor cluster health, resource usage, and application performance with Cloud Monitoring and Logging integration. Configure security policies with Pod Security Standards, Binary Authorization, and network policies. Manage multi-cluster deployments with GKE Enterprise, implement service mesh with Anthos Service Mesh, and use Config Sync for GitOps workflows. Perfect for teams running cloud-native applications at scale."
  }
}
