{
  "scopeName": "digitalocean",
  "name": "digitalocean-databases-mcp",
  "friendlyName": "DigitalOcean Databases",
  "connection": {
    "type": "HTTP",
    "url": "https://databases.mcp.digitalocean.com/mcp"
  },
  "description": "Manage DigitalOcean managed databases through natural language. Create, configure, and monitor PostgreSQL, MySQL, Redis, and MongoDB databases with AI assistance.",
  "icon": "https://www.digitalocean.com/_next/static/media/logo.0f4b57fd.svg",
  "unlisted": false,
  "metadata": {
    "category": "Database",
    "official": true,
    "mesh_unlisted": true,
    "tags": ["database", "postgresql", "mysql", "redis", "mongodb", "managed-database", "digitalocean", "backup", "scaling"],
    "short_description": "Manage DigitalOcean managed databases through natural language",
    "mesh_description": "DigitalOcean Managed Databases provide fully managed, highly available database solutions for PostgreSQL, MySQL, Redis, MongoDB, and OpenSearch. This official MCP allows you to create and manage database clusters with automatic failover, daily backups, and point-in-time recovery. Scale vertically by adjusting CPU and RAM, or horizontally by adding read replicas for improved read performance. The platform handles maintenance windows, security patches, and minor version upgrades automatically. Configure connection pooling for PostgreSQL to optimize connection management, set up trusted sources and firewall rules for security, and enable SSL/TLS encryption for data in transit. Monitor database performance with real-time metrics including CPU usage, memory consumption, disk I/O, connection count, and query performance. Manage database users and permissions, configure replication lag monitoring, and set up automated backup schedules with retention policies. The MCP supports database migrations, schema changes, and provides query optimization suggestions. Access advanced features like PostgreSQL extensions, MySQL custom parameters, Redis persistence modes, and MongoDB sharding configuration through intuitive natural language commands."
  }
}
