{
  "scopeName": "mercadolibre",
  "name": "mercadopago-mcp",
  "friendlyName": "Mercado Pago",
  "connection": {
    "type": "HTTP",
    "url": "https://mcp.mercadopago.com/mcp"
  },
  "description": "Process payments and manage financial operations with Latin America's leading fintech platform. Handle transactions, refunds, subscriptions, and payment analytics through natural language.",
  "icon": "https://http2.mlstatic.com/frontend-assets/ui-navigation/5.19.1/mercadolibre/favicon.svg",
  "unlisted": false,
  "metadata": {
    "categories": ["Payments"],
    "official": true,
    "mesh_unlisted": true,
    "tags": ["payments", "fintech", "transactions", "latin-america", "mercadopago", "gateway", "subscriptions", "refunds", "checkout"],
    "short_description": "Process payments and manage financial operations with Latin America's leading fintech",
    "mesh_description": "Mercado Pago is Latin America's largest fintech platform processing billions of dollars in transactions annually across 18 countries. This official MCP provides comprehensive payment processing capabilities for credit cards, debit cards, digital wallets, bank transfers, cash payments, and cryptocurrencies. Create secure checkout experiences with customizable payment forms, one-click checkout for returning customers, and mobile-optimized payment flows. Process payments with smart routing to maximize approval rates, automatic retry logic for failed transactions, and real-time fraud detection and prevention. Manage recurring subscriptions with flexible billing cycles, automatic payment collection, and dunning management for failed payments. Handle refunds, chargebacks, and disputes efficiently with automated workflows and detailed transaction history. Access comprehensive financial analytics including transaction volumes, approval rates, payment methods distribution, and revenue trends. Configure installment payments with interest-free or interest-bearing options to increase conversion rates. Integrate with major e-commerce platforms, point-of-sale systems, and custom applications through robust APIs. Use QR code payments for in-person transactions with instant confirmation. Manage seller balances, withdrawals, and settlement schedules. Implement 3D Secure authentication for enhanced security compliance. Perfect for businesses of all sizes processing payments in Latin American markets with multi-currency support and local payment methods."
  }
}
